# the Purpose of the notebook:


to explore the data analysis in Assignment 2.
summarize the questions in my part and prepare the discuss the question in the tutorial with the group members.
As the group manager, I am responsible for tracking each part of the assignment and making sure everything is fine.
As the checklist for each week to warning myself what I should do in the following classes.

# Week 7

Understand the meaning of the dataset and select the preference one for the follow steps.

In [ ]:
import pandas as pd
import numpy as np
df1 = pd.read_csv("person1.csv")
df1

                   Source        Date  Hour  Count
0       Person1 iPhone SE  2014-12-07     8     13
1       Person1 iPhone SE  2014-12-07     8     13
2       Person1 iPhone SE  2014-12-07     8      1
3       Person1 iPhone SE  2014-12-07     8      9
4       Person1 iPhone SE  2014-12-07     8     15
...                   ...         ...   ...    ...
183782  Person1 iPhone SE  2021-09-22    17   1241
183783  Person1 iPhone SE  2021-09-22    17   1212
183784  Person1 iPhone SE  2021-09-22    18    808
183785  Person1 iPhone SE  2021-09-22    18    392
183786  Person1 iPhone SE  2021-09-22    18     34

[183787 rows x 4 columns]

import the data

In [ ]:
df1.isnull().values.any()

False

check if there is any NaN value and the answer is no.